# ReinforcementData Properties

---
The ReinforcementData type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
ReinforcementData Class
Autodesk.Revit.DB.Structure Namespace